using System;
using System.Collections.Generic;
using System.Text;

namespace KnowledgeBaseLibrary.FundamentalVariables
{
    public enum FactorTitle
    {
        dt,         // Длительность провала напряжения
        K2U,        // Коэффициент несимметрии напряжений по обратной последовательности
        K2Ui,       // Несимметрия напряжений
        KUn,        // Коэффициент n-ой гармонической составляющей напряжения
        Weather,    // Погодные условия
        Ua,         // Напряжения по фазе A
        Ub,         // Напряжения по фазе B
        Uc,         // Напряжения по фазе C
        Uimp,       // Грозовые импульсные напряжения
        dUabc,      // Отклонение напряжения по фазам А, В, С
        KU,         // Коэффициент искажения синусоидальности кривой напряжения
        Uns,        // Несинусоидальность напряжения
        ServiceabilityEquipment     // Исправность технического состояния оборудования
    }
}
